# taps
tap "homebrew/bundle"

# utilities
brew "awscli"
brew "bat"
brew "cmatrix"
brew "docker-credential-helper"
brew "dvc"
brew "gdal"
brew "gh"
brew "htop"
brew "jq"
brew "node"
brew "ponysay"
brew "powerlevel10k"
brew "pulumi"
brew "python@3.9"
brew "python@3.10"
brew "python@3.11"
brew "python@3.12"
brew "python@3.13"
brew "python@3"
brew "r"
brew "speedtest-cli"
brew "sqlite"
brew "thefuck"
brew "tldr"
brew "tree"
brew "udunits"
brew "uvicorn"
brew "vim"
brew "wget"


# third-party apps
cask "1password"
cask "1password-cli"
cask "brave-browser"
cask "dbeaver-community"
cask "docker"
cask "dropbox"
cask "firefox"
cask "font-meslo-for-powerlevel10k"
cask "google-chrome"
cask "iterm2"
cask "miniforge"
cask "postman"
cask "slack"
cask "visual-studio-code"
cask "zoom"

# vscode extentions
# vscode "christian-kohler.path-intellisense"
# vscode "donjayamanne.python-environment-manager"
# vscode "iterative.dvc"
# vscode "ms-azuretools.vscode-docker"
# vscode "ms-python.isort"
# vscode "ms-python.python"
# vscode "ms-python.vscode-pylance"
# vscode "ms-toolsai.jupyter"
# vscode "ms-toolsai.jupyter-keymap"
# vscode "ms-toolsai.jupyter-renderers"
# vscode "ms-toolsai.vscode-jupyter-cell-tags"
# vscode "ms-toolsai.vscode-jupyter-slideshow"
# vscode "ms-vscode-remote.remote-containers"
# vscode "ms-vscode-remote.remote-ssh"
# vscode "ms-vscode-remote.remote-ssh-edit"
# vscode "ms-vscode-remote.remote-wsl"
# vscode "ms-vscode-remote.vscode-remote-extensionpack"
# vscode "ms-vscode.remote-explorer"
# vscode "redhat.vscode-yaml"
# vscode "ryuta46.multi-command"
# vscode "vscodevim.vim"
# vscode "jojoee.conda-cheatsheet"