# taps
tap "homebrew/bundle"

#
brew "bat"
brew "sqlite"
brew "htop"
brew "tree"
brew "tldr"
brew "vim"
brew "python@3.9"
brew "python@3.10"
brew "python@3.11"
brew "python@3.12"
brew "python@3.13"
brew "python@3"
brew "powerlevel10k"


# casks
cask "miniforge"
cask "visual-studio-code"
cask "docker"
cask "iterm2"
cask "firefox"
cask "1password"
cask "1password-cli"
cask "slack"
cask "zoom"
cask "font-meslo-for-powerlevel10k"

# vscode extentions
# vscode "christian-kohler.path-intellisense"
# vscode "donjayamanne.python-environment-manager"
# vscode "iterative.dvc"
# vscode "ms-azuretools.vscode-docker"
# vscode "ms-python.isort"
# vscode "ms-python.python"
# vscode "ms-python.vscode-pylance"
# vscode "ms-toolsai.jupyter"
# vscode "ms-toolsai.jupyter-keymap"
# vscode "ms-toolsai.jupyter-renderers"
# vscode "ms-toolsai.vscode-jupyter-cell-tags"
# vscode "ms-toolsai.vscode-jupyter-slideshow"
# vscode "ms-vscode-remote.remote-containers"
# vscode "ms-vscode-remote.remote-ssh"
# vscode "ms-vscode-remote.remote-ssh-edit"
# vscode "ms-vscode-remote.remote-wsl"
# vscode "ms-vscode-remote.vscode-remote-extensionpack"
# vscode "ms-vscode.remote-explorer"
# vscode "redhat.vscode-yaml"
# vscode "ryuta46.multi-command"
# vscode "vscodevim.vim"
# vscode "jojoee.conda-cheatsheet"